Revit 2024 API
WireType.TemperatureRating Property
 The temperature rating type of the wire type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public TemperatureRatingType TemperatureRating { get; set; }
Visual Basic
Public Property TemperatureRating As TemperatureRatingType
	Get
	Set
Visual C++
public:
property TemperatureRatingType^ TemperatureRating {
	TemperatureRatingType^ get ();
	void set (TemperatureRatingType^ value);
}
Remarks
Should retrieved from relevant WireMaterial object.
See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace